{"@context":"https://schema.org","@type":"Event","name":"Apéro PHP - Symfony Authentication: What's next?","description":"<p class=\"mb-4\">L'AFUP Poitiers vous invite à une conférence de Robin Chalas, membre de la core Team Symfony pour sa conférence sur la sécurité (<strong>conférence en français</strong>)</p>\n<p class=\"mb-4\"><strong>Symfony Authentication: What's next?</strong></p>\n<p class=\"mb-4\">The Security component has changed a lot in the past few years.</p>\n<p class=\"mb-4\">From Authentication Listeners to Guard and finally the Authenticator Manager system, Symfony now has the most robust infrastructure ever to support most if not all modern, industry-standard Security protocols.</p>\n<p class=\"mb-4\">The community started building on these new foundations by introducing an AccessTokenAuthenticator and kept improving it since then, notably through adding more token handlers for well-known authentication protocols.\n\nThat's pretty cool already, but what should we expect next? How far will we take it?</p>\n<p class=\"mb-4\">In this talk, I'm going to put my Security maintainer hat on to answer these questions and share some insights about what's going on in this critical part of our beloved framework.</p>\n<p class=\"mb-4\">En savoir plus sur Robin : https://connect.symfony.com/profile/chalas_r</p>\n<p class=\"mb-4\">MERCI 🤩\n\nCobalt, pour l'accueil\n\nLe SPN, pour les défraiements speaker</p>\n<p class=\"mb-4\">Et vu qu'un apéro n'est pas apéro sans prendre l'apéro, un pot sera servir à la fin de la conférence ! Il vous sera offert par Emile's \"Votre collègue bon plans\"</p>","startDate":"2024-12-12T19:00:00+01:00","endDate":"2024-12-12T21:00:00+01:00","location":{"@type":"Place","name":"Cobalt","address":{"@type":"PostalAddress","addressLocality":"Poitiers","streetAddress":"5 rue Victor Hugo, Poitiers"}},"image":"https://secure.meetupstatic.com/photos/event/9/7/c/a/600_511718858.jpeg","organizer":"Afup","url":"https://www.meetup.com/afup-poitiers-php/events/304626149/"}