{"@context":"https://schema.org","@type":"Event","name":"Apéro PHP - Playwright pour les devs back (sans stress)","description":"<p class=\"mb-4\"><strong>(ATTENTION - NOUS SOMMES INVITES CHEZ EMILE'S)</strong></p>\n<p class=\"mb-4\">L'AFUP Poitiers vous invite à une conférence de Marc Antoine Da Mota</p>\n<p class=\"mb-4\"><strong>Playwright pour les devs back : vos premiers pas dans les tests end-to-end (sans stress)</strong></p>\n<p class=\"mb-4\">Dans cette conférence, découvrez comment Playwright, un outil puissant de tests end-to-end, peut transformer la manière dont les développeurs back-end abordent la qualité du front. Animée par un développeur junior, cette session vous montre, étape par étape, comment configurer Playwright, écrire vos premiers tests simples, et vérifier le bon fonctionnement de vos applications web comme un pro du QA.</p>\n<p class=\"mb-4\">Avec un focus sur l'accessibilité et la simplicité, cet atelier est idéal pour ceux qui n'ont jamais touché un outil de test e2e ou qui pensent que ces tests sont réservés aux devs front. Vous repartirez avec des bases solides et les clés pour intégrer les tests end-to-end dans vos projets back-end.</p>\n<p class=\"mb-4\">MERCI 🤩\n\nEmile's pour l'accueil et l'apéritif</p>\n<p class=\"mb-4\">Et vu qu'un apéro n'est pas apéro sans prendre l'apéro, un pot sera servi à la fin de la conférence !</p>\n<p class=\"mb-4\"><strong>ATTENTION : nous nous retrouverons chez Emile's</strong>\n\n11 rue de la goélette\n\n86280 St Benoit\n\n(au dessus de LDLC, la porte à droite de LDCL quand on le regarde de face)</p>\n<p class=\"mb-4\"><strong>Début de la conférence à 19h00</strong></p>","startDate":"2025-02-20T19:00:00+01:00","endDate":"2025-02-20T21:00:00+01:00","location":{"@type":"Place","name":"Emile's","address":{"@type":"PostalAddress","addressLocality":"Saint-Benoît","streetAddress":"11 rue de la goélette, Saint-Benoît"}},"image":"https://secure.meetupstatic.com/photos/event/9/7/c/a/600_511718858.jpeg","organizer":"Afup","url":"https://www.meetup.com/afup-poitiers-php/events/305770763/"}