<script type="application/ld+json">{"@context":"https://schema.org","@type":"Event","name":"Soirée AFUP / PWN : Assurance qualité web : quels enjeux pour le développement web ?","description":"L'association PWN Poitiers Web Nerdz et l'AFUP Poitiers se retrouvent une nouvelle fois, le jeudi 16 mars 2023 à 19h00 à Cobalt, pour co-organiser la soirée Super Apéro PHP, en partenariat avec nos sponsors le Réseau SPN, Serli, la NACorp.Les deux associations vont vous proposer la conférence \"Assurance qualité web : quels enjeux pour le développement web ?\" présentée par Élie Sloïm.La notion de QA (Quality Assurance) est souvent associée à la pratique des tests unitaires et fonctionnels. Pourtant, en tant qu'utilisateurs, nous constatons au quotidien que cette approche est insuffisante pour garantir le niveau de qualité des sites. C'est l'un des enjeux de l'assurance qualité web qui permet de prendre en compte d'autres aspects complémentaires et transversaux comme l'éco-conception, l'accessibilité web, la sécurité, la préservation des données personnelles, ou encore le e-commerce et la performance web.Tous ces éléments ont un impact majeur sur les utilisateurs finaux, ils représentent des sources de risques critiques pour les organisations et ils mobilisent des équipes web multidisciplinaires comportant des équipes de développement, bien sûr mais aussi des product owners, des graphistes, des spécialistes SEO ou marketing, des chefs de projet, des contributeurs ou même des représentants des métiers.Dans cette conférence, nous réfléchirons au périmètre et aux enjeux de l'assurance qualité web pour les organisations et pour les personnes qui y travaillent.Je montrerai comment ces règles peuvent aider à mieux prendre en compte dans nos projets ce qui se passe de l'autre côté de l'écran, chez les utilisateurs. Je me pencherai sur les enjeux respectifs pour les développeuses et développeurs back et front. J'expliquerai comment des règles d'assurance qualité web peuvent donner du sens à nos métiers et créer une culture commune au sein des équipes web.","startDate":"2023-03-16T19-00-00","endDate":"2023-03-16T21-00-00","location":{"@type":"Place","name":"Cobalt","address":{"@type":"PostalAddress","addressLocality":"","streetAddress":""}},"image":"http://pwn-association.org/media/filer_public/84/b8/84b8178f-e3c5-4dfb-a13d-26009a312ff8/logo-afup-pwn.png","organizer":"pwn","url":"http://pwn-association.org/evenements/soiree-afup-pwn-assurance-qualite-web-quels-enjeux-pour-le-developpement-web/"}</script>